[Killed] ArithmeticOperator
guru/src/expressionTree/node.ts:14:20
     private readonly right: Node | undefined;
     
     private readonly resultOperations: MappedOperations = {
-        '+': () => this.left!.result() + this.right!.result(),
+        '+': () => this.left!.result() - this.right!.result(),
         '-': () => this.left!.result() - this.right!.result(),
         'x': () => this.left!.result() * this.right!.result(),
killedBy: node complex expression tree with several nodes given a expression tree when result is called should resolver the expression and return the value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 0.3333333333333333

[Killed] ArithmeticOperator
guru/src/expressionTree/node.ts:15:20
     
     private readonly resultOperations: MappedOperations = {
         '+': () => this.left!.result() + this.right!.result(),
-        '-': () => this.left!.result() - this.right!.result(),
+        '-': () => this.left!.result() + this.right!.result(),
         'x': () => this.left!.result() * this.right!.result(),
         '÷': () => this.left!.result() / this.right!.result(),
killedBy: node complex expression tree with several nodes given a expression tree when result is called should resolver the expression and return the value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 5.333333333333333

[Killed] ArithmeticOperator
guru/src/expressionTree/node.ts:16:20
     private readonly resultOperations: MappedOperations = {
         '+': () => this.left!.result() + this.right!.result(),
         '-': () => this.left!.result() - this.right!.result(),
-        'x': () => this.left!.result() * this.right!.result(),
+        'x': () => this.left!.result() / this.right!.result(),
         '÷': () => this.left!.result() / this.right!.result(),
         'default': () => this.value
killedBy: node complex expression tree with several nodes given a expression tree when result is called should resolver the expression and return the value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 1.2

[Killed] ArithmeticOperator
guru/src/expressionTree/node.ts:17:20
         '+': () => this.left!.result() + this.right!.result(),
         '-': () => this.left!.result() - this.right!.result(),
         'x': () => this.left!.result() * this.right!.result(),
-        '÷': () => this.left!.result() / this.right!.result(),
+        '÷': () => this.left!.result() * this.right!.result(),
         'default': () => this.value
     }
killedBy: node complex expression tree with several nodes given a expression tree when result is called should resolver the expression and return the value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: 72

[Killed] StringLiteral
guru/src/expressionTree/node.ts:24:20
     private readonly toStringOperations: MappedOperations = {
         '+': () => `(${this.left!.toString()} + ${this.right!.toString()})`,
         '-': () => `(${this.left!.toString()} - ${this.right!.toString()})`,
-        'x': () => `(${this.left!.toString()} x ${this.right!.toString()})`,
+        'x': () => ``,
         '÷': () => `(${this.left!.toString()} ÷ ${this.right!.toString()})`,
         'default': () => this.value.toString()
killedBy: node complex expression tree with several nodes given a expression tree when toString is called should return the formula expression
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "((7 + ((3 - 2) x 5)) ÷ 6)"
Received: "((7 + ) ÷ 6)"

[Killed] StringLiteral
guru/src/expressionTree/node.ts:25:20
         '+': () => `(${this.left!.toString()} + ${this.right!.toString()})`,
         '-': () => `(${this.left!.toString()} - ${this.right!.toString()})`,
         'x': () => `(${this.left!.toString()} x ${this.right!.toString()})`,
-        '÷': () => `(${this.left!.toString()} ÷ ${this.right!.toString()})`,
+        '÷': () => ``,
         'default': () => this.value.toString()
     }
killedBy: node complex expression tree with several nodes given a expression tree when toString is called should return the formula expression
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "((7 + ((3 - 2) x 5)) ÷ 6)"
Received: ""

[Killed] LogicalOperator
guru/src/expressionTree/node.ts:48:28
 
     private evaluate (obj: MappedOperations) {
         if (typeof this.value === 'string') {
-            const method = obj[this.value] ?? obj.default;
+            const method = obj[this.value] && obj.default;
             return method();
         } else {
killedBy: node complex expression tree with several nodes given a expression tree when result is called should resolver the expression and return the value
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 2
Received: NaN
