[Killed] BlockStatement
guru/src/flattenArray/flatten-array.ts:1:45
-function flattenArray (arr: Array<unknown>) {
-    const flattenedArray: Array<unknown> = [];
-    
-    arr.forEach(x => {
-        if (Array.isArray(x)) {
-            flattenedArray.push(...flattenArray(x));
-        } else {
-            flattenedArray.push(x);
-        }
-    })
-
-    return flattenedArray;
-}
+function flattenArray (arr: Array<unknown>) {}
 
 export default flattenArray
killedBy: flatten-array given a flat array should return a flat array
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [1, 2, 3]
Received: undefined

[Killed] BlockStatement
guru/src/flattenArray/flatten-array.ts:4:22
 function flattenArray (arr: Array<unknown>) {
     const flattenedArray: Array<unknown> = [];
     
-    arr.forEach(x => {
-        if (Array.isArray(x)) {
-            flattenedArray.push(...flattenArray(x));
-        } else {
-            flattenedArray.push(x);
-        }
-    })
+    arr.forEach(x => {})
 
     return flattenedArray;
killedBy: flatten-array given a flat array should return a flat array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] BlockStatement
guru/src/flattenArray/flatten-array.ts:5:31
     const flattenedArray: Array<unknown> = [];
     
     arr.forEach(x => {
-        if (Array.isArray(x)) {
-            flattenedArray.push(...flattenArray(x));
-        } else {
+        if (Array.isArray(x)) {} else {
             flattenedArray.push(x);
         }
killedBy: flatten-array given a nested array should return a flag array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   1,
-   2,

[Killed] BlockStatement
guru/src/flattenArray/flatten-array.ts:7:16
     arr.forEach(x => {
         if (Array.isArray(x)) {
             flattenedArray.push(...flattenArray(x));
-        } else {
-            flattenedArray.push(x);
-        }
+        } else {}
     })
 
killedBy: flatten-array given a flat array should return a flat array
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Array [
-   1,
-   2,
